; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v1 ?v5)
             (pred_9 ?v9 ?v12)
             (pred_7 ?v1 ?v12)
             (pred_8 ?v6 ?v1 )
	     (pred_6 ?v1)
             (pred_1 ?v3)
             (pred_4 ?v9)
             (pred_11 ?v12)
             (pred_5 ?v1)
             (pred_2 ?v9)
             (pred_10 ?v1)
             (pred_3 ))



(:action op_3
:parameters (?v13 ?v7 ?v2 ?v8)
:precondition (and (pred_1 ?v13) (pred_1 ?v7) (pred_4 ?v2) (pred_11 ?v8)
          (pred_12 ?v13 ?v7) (pred_9 ?v2 ?v8)
                   (pred_7 ?v7 ?v8) (pred_6 ?v13) 
                   (pred_5 ?v7) (pred_2 ?v2))
:effect (and  (pred_10 ?v7) (not (pred_5 ?v7))))


(:action op_4
:parameters (?v13 ?v11)
:precondition (and (pred_1 ?v13) (pred_1 ?v11)
               (pred_6 ?v13) (pred_12 ?v13 ?v11) (pred_10 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v13))))

(:action op_1
:parameters (?v13 ?v2)
:precondition (and (pred_1 ?v13) (pred_4 ?v2) 
                  (pred_6 ?v13) (pred_8 ?v2 ?v13) (pred_3 ))
:effect (and (pred_2 ?v2)
   (not (pred_8 ?v2 ?v13)) (not (pred_3 ))))


(:action op_2
:parameters (?v13 ?v10 ?v4)
:precondition (and (pred_1 ?v13) (pred_4 ?v10) (pred_4 ?v4)
                  (pred_6 ?v13) (pred_2 ?v4) (pred_8 ?v10 ?v13))
:effect (and (pred_2 ?v10) (pred_8 ?v4 ?v13)
        (not (pred_2 ?v4)) (not (pred_8 ?v10 ?v13))))

(:action op_5
:parameters (?v13 ?v2)
:precondition (and (pred_1 ?v13) (pred_4 ?v2) 
                  (pred_6 ?v13) (pred_2 ?v2))
:effect (and (pred_3 ) (pred_8 ?v2 ?v13) (not (pred_2 ?v2)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_01 obj_11 obj_30 obj_14 obj_26 obj_18 obj_29 obj_12 obj_23 obj_32 obj_28 obj_09 obj_22 obj_16 obj_05 obj_10 obj_02 obj_20 obj_31 obj_15 obj_25 obj_08 obj_06 obj_24 obj_27
    obj_21 obj_13 obj_03
    obj_19 obj_17 obj_07 obj_04
    )

    (:init
       (pred_3)

       (pred_1 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_30)
       (pred_1 obj_14)
       (pred_1 obj_26)
       (pred_1 obj_18)
       (pred_1 obj_29)
       (pred_1 obj_12)
       (pred_1 obj_23)
       (pred_1 obj_32)
       (pred_1 obj_28)
       (pred_1 obj_09)
       (pred_1 obj_22)
       (pred_1 obj_16)
       (pred_1 obj_05)
       (pred_1 obj_10)
       (pred_1 obj_02)
       (pred_1 obj_20)
       (pred_1 obj_31)
       (pred_1 obj_15)
       (pred_1 obj_25)
       (pred_1 obj_08)
       (pred_1 obj_06)
       (pred_1 obj_24)
       (pred_1 obj_27)
       (pred_11 obj_21)
       (pred_11 obj_13)
       (pred_11 obj_03)
       (pred_4 obj_19)
       (pred_4 obj_17)
       (pred_4 obj_07)
       (pred_4 obj_04)

       (pred_12 obj_01 obj_18)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_11 obj_29)
       (pred_12 obj_11 obj_30)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_30 obj_12)
       (pred_12 obj_30 obj_14)
       (pred_12 obj_30 obj_11)
       (pred_12 obj_14 obj_23)
       (pred_12 obj_14 obj_26)
       (pred_12 obj_14 obj_30)
       (pred_12 obj_26 obj_32)
       (pred_12 obj_26 obj_14)
       (pred_12 obj_18 obj_28)
       (pred_12 obj_18 obj_29)
       (pred_12 obj_18 obj_01)
       (pred_12 obj_29 obj_09)
       (pred_12 obj_29 obj_12)
       (pred_12 obj_29 obj_11)
       (pred_12 obj_29 obj_18)
       (pred_12 obj_12 obj_22)
       (pred_12 obj_12 obj_23)
       (pred_12 obj_12 obj_30)
       (pred_12 obj_12 obj_29)
       (pred_12 obj_23 obj_16)
       (pred_12 obj_23 obj_32)
       (pred_12 obj_23 obj_14)
       (pred_12 obj_23 obj_12)
       (pred_12 obj_32 obj_05)
       (pred_12 obj_32 obj_26)
       (pred_12 obj_32 obj_23)
       (pred_12 obj_28 obj_10)
       (pred_12 obj_28 obj_09)
       (pred_12 obj_28 obj_18)
       (pred_12 obj_09 obj_02)
       (pred_12 obj_09 obj_22)
       (pred_12 obj_09 obj_29)
       (pred_12 obj_09 obj_28)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_22 obj_16)
       (pred_12 obj_22 obj_12)
       (pred_12 obj_22 obj_09)
       (pred_12 obj_16 obj_31)
       (pred_12 obj_16 obj_05)
       (pred_12 obj_16 obj_23)
       (pred_12 obj_16 obj_22)
       (pred_12 obj_05 obj_15)
       (pred_12 obj_05 obj_32)
       (pred_12 obj_05 obj_16)
       (pred_12 obj_10 obj_25)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_10 obj_28)
       (pred_12 obj_02 obj_08)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_02 obj_09)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_20 obj_06)
       (pred_12 obj_20 obj_31)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_31 obj_24)
       (pred_12 obj_31 obj_15)
       (pred_12 obj_31 obj_16)
       (pred_12 obj_31 obj_20)
       (pred_12 obj_15 obj_27)
       (pred_12 obj_15 obj_05)
       (pred_12 obj_15 obj_31)
       (pred_12 obj_25 obj_08)
       (pred_12 obj_25 obj_10)
       (pred_12 obj_08 obj_06)
       (pred_12 obj_08 obj_02)
       (pred_12 obj_08 obj_25)
       (pred_12 obj_06 obj_24)
       (pred_12 obj_06 obj_20)
       (pred_12 obj_06 obj_08)
       (pred_12 obj_24 obj_27)
       (pred_12 obj_24 obj_31)
       (pred_12 obj_24 obj_06)
       (pred_12 obj_27 obj_15)
       (pred_12 obj_27 obj_24)
       (pred_5 obj_30)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_23)
       (pred_7  obj_30 obj_21)
       (pred_7  obj_11 obj_13)
       (pred_7  obj_20 obj_03)
       (pred_7  obj_23 obj_03)
       (pred_10 obj_01)
       (pred_10 obj_14)
       (pred_10 obj_26)
       (pred_10 obj_18)
       (pred_10 obj_29)
       (pred_10 obj_12)
       (pred_10 obj_32)
       (pred_10 obj_28)
       (pred_10 obj_09)
       (pred_10 obj_22)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_10)
       (pred_10 obj_02)
       (pred_10 obj_31)
       (pred_10 obj_15)
       (pred_10 obj_25)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_24)
       (pred_10 obj_27)

       (pred_9  obj_19 obj_21)
       (pred_9  obj_17 obj_13)
       (pred_9  obj_07 obj_03)
       (pred_9  obj_04 obj_21)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_17 obj_27)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_04 obj_27)
       (pred_6 obj_12)
    )

    (:goal (and
       (pred_8 obj_19 obj_22)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_04 obj_31)
    ))
(:constraints
  (always (not (pred_6 obj_16)))
)
)

; plan
1. (op_4 obj_12 obj_29)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_29)
   goals met: 0 of 3
2. (op_4 obj_29 obj_18)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_18)
   goals met: 0 of 3
3. (op_4 obj_18 obj_28)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_28)
   goals met: 0 of 3
4. (op_4 obj_28 obj_10)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_10)
   goals met: 0 of 3
5. (op_1 obj_10 obj_07)
   deleted: (pred_8 obj_07 obj_10) (pred_3)
   added: (pred_2 obj_07)
   goals met: 0 of 3
6. (op_4 obj_10 obj_28)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_28)
   goals met: 0 of 3
7. (op_5 obj_28 obj_07)
   deleted: (pred_2 obj_07)
   added: (pred_3) (pred_8 obj_07 obj_28)
   goals met: 0 of 3
8. (op_4 obj_28 obj_10)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_10)
   goals met: 0 of 3
9. (op_1 obj_10 obj_19)
   deleted: (pred_8 obj_19 obj_10) (pred_3)
   added: (pred_2 obj_19)
   goals met: 0 of 3
10. (op_4 obj_10 obj_28)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_28)
   goals met: 0 of 3
11. (op_4 obj_28 obj_09)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_09)
   goals met: 0 of 3
12. (op_4 obj_09 obj_22)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_22)
   goals met: 0 of 3
13. (op_5 obj_22 obj_19)
   deleted: (pred_2 obj_19)
   added: (pred_3) (pred_8 obj_19 obj_22)
   goals met: 1 of 3
14. (op_4 obj_22 obj_09)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_09)
   goals met: 1 of 3
15. (op_4 obj_09 obj_02)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_02)
   goals met: 1 of 3
16. (op_4 obj_02 obj_08)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_08)
   goals met: 1 of 3
17. (op_4 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 1 of 3
18. (op_4 obj_06 obj_24)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_24)
   goals met: 1 of 3
19. (op_4 obj_24 obj_27)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_27)
   goals met: 1 of 3
20. (op_1 obj_27 obj_04)
   deleted: (pred_8 obj_04 obj_27) (pred_3)
   added: (pred_2 obj_04)
   goals met: 1 of 3
21. (op_4 obj_27 obj_24)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_24)
   goals met: 1 of 3
22. (op_4 obj_24 obj_31)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_31)
   goals met: 1 of 3
23. (op_5 obj_31 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_3) (pred_8 obj_04 obj_31)
   goals met: 2 of 3
24. (op_4 obj_31 obj_24)
   deleted: (pred_6 obj_31)
   added: (pred_6 obj_24)
   goals met: 2 of 3
25. (op_4 obj_24 obj_06)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_06)
   goals met: 2 of 3
26. (op_4 obj_06 obj_08)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_08)
   goals met: 2 of 3
27. (op_4 obj_08 obj_02)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_02)
   goals met: 2 of 3
28. (op_4 obj_02 obj_09)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_09)
   goals met: 2 of 3
29. (op_4 obj_09 obj_22)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_22)
   goals met: 2 of 3
30. (op_1 obj_22 obj_19)
   deleted: (pred_8 obj_19 obj_22) (pred_3)
   added: (pred_2 obj_19)
   goals met: 1 of 3
31. (op_4 obj_22 obj_12)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_12)
   goals met: 1 of 3
32. (op_3 obj_12 obj_30 obj_19 obj_21)
   deleted: (pred_5 obj_30)
   added: (pred_10 obj_30)
   goals met: 1 of 3
33. (op_4 obj_12 obj_22)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_22)
   goals met: 1 of 3
34. (op_5 obj_22 obj_19)
   deleted: (pred_2 obj_19)
   added: (pred_3) (pred_8 obj_19 obj_22)
   goals met: 2 of 3
35. (op_4 obj_22 obj_09)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_09)
   goals met: 2 of 3
36. (op_4 obj_09 obj_02)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_02)
   goals met: 2 of 3
37. (op_4 obj_02 obj_08)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_08)
   goals met: 2 of 3
38. (op_4 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 2 of 3
39. (op_4 obj_06 obj_24)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_24)
   goals met: 2 of 3
40. (op_4 obj_24 obj_27)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_27)
   goals met: 2 of 3
41. (op_1 obj_27 obj_17)
   deleted: (pred_8 obj_17 obj_27) (pred_3)
   added: (pred_2 obj_17)
   goals met: 2 of 3
42. (op_4 obj_27 obj_15)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_15)
   goals met: 2 of 3
43. (op_4 obj_15 obj_05)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_05)
   goals met: 2 of 3
44. (op_4 obj_05 obj_32)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_32)
   goals met: 2 of 3
45. (op_4 obj_32 obj_26)
   deleted: (pred_6 obj_32)
   added: (pred_6 obj_26)
   goals met: 2 of 3
46. (op_4 obj_26 obj_14)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_14)
   goals met: 2 of 3
47. (op_4 obj_14 obj_30)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_30)
   goals met: 2 of 3
48. (op_3 obj_30 obj_11 obj_17 obj_13)
   deleted: (pred_5 obj_11)
   added: (pred_10 obj_11)
   goals met: 2 of 3
49. (op_4 obj_30 obj_11)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_11)
   goals met: 2 of 3
50. (op_5 obj_11 obj_17)
   deleted: (pred_2 obj_17)
   added: (pred_3) (pred_8 obj_17 obj_11)
   goals met: 3 of 3
